app/controllers/examples_controller.rb

  def index
    @examples = Example.all
---
SELECT SUM(price) FROM "examples"
SELECT "examples".* FROM "examples"

  def create
    File.foreach(params[:file].path).with_index do |line, index|
      if index > 0
         aux = line.split(/\t/)
         example = Example.new
         example.purchaser_name = aux[0]
         example.item_description = aux[1]
         example.item_price = aux[2]
         example.purchase_count = aux[3]
         example.merchant_address = aux[4]
         example.merchant_name = aux[5]
         example.save
---
INSERT INTO "examples" ("purchaser_name", "item_description", "item_price", "purchase_count", "merchant_address", "merchant_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @example.update(example_params)
---
UPDATE "examples" SET "merchant_name" = ?, "updated_at" = ? WHERE "examples"."id" = ?  [["merchant_name", "Bob's Pizza"], ["updated_at", "2018-04-26 02:06:39.996591"], ["id", 1]]

  def destroy
    @example.destroy
---
DELETE FROM "examples" WHERE "examples"."id" = ?  [["id", 1]]

    def set_example
      @example = Example.find(params[:id])
---
SELECT  "examples".* FROM "examples" WHERE "examples"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]